erinmi4/SmartAgriculture/USER/stm32f407project/src/main.c
/* =================== 调试开关 =================== */
// 逐步启用模块进行调试，确保系统稳定运行
#define ENABLE_DHT11       0    // 1-启用DHT11, 0-禁用DHT11 (温湿度传感器) - 先禁用排查
#define ENABLE_MPU6050     0    // 1-启用MPU6050, 0-禁用MPU6050 (姿态传感器) - 现在启用并测试角度显示
#define ENABLE_MQ2         0    // 1-启用MQ2, 0-禁用MQ2 (烟雾传感器) - 先禁用排查
#define ENABLE_LIGHT       1    // 1-启用光敏电阻, 0-禁用光敏电阻 (简单ADC)
#define ENABLE_BLUETOOTH   1    // 1-启用蓝牙, 0-禁用蓝牙 (远程控制)
#define ENABLE_BREATHING   0    // 1-启用呼吸灯, 0-禁用呼吸灯 (状态指示) - 先禁用排查
#define ENABLE_ALARM       1    // 1-启用报警, 0-禁用报警 (蜂鸣器和LED)

/* =================== 头文件包含 =================== */
#include "stm32f4xx.h"
#include "delay.h"
#include "led.h"
#include "key.h"
#include "lcd.h"
#include "sys.h"
#include "DHT11.h"
#include "light.h"
#include "mpu6050.h"
#include "mpu6050_angle_display.h"  // 添加角度显示功能
#include "mq2.h"
#include "bluetooth.h"
#include "beep.h"
#include "ADC3.h"
#include "uart.h"        // 添加UART头文件以支持UART_BAUD_9600
#include <stdio.h>
#include <string.h>
#include <stdlib.h>

/* =================== 缺失函数声明 =================== */
// 注：实际的函数名在对应的头文件中定义
// delay_init 不存在，可以删除或创建空函数
// beep_init -> Beep_Init
// beep_on -> Beep_On  
// beep_off -> Beep_Off
// LED0_Toggle -> Led_Toggle

/* =================== 系统定义 =================== */
#define TEMP_HIGH_THRESHOLD  29    // 温度高报警阈值(℃)  
#define TEMP_LOW_THRESHOLD   20    // 温度低报警阈值(℃)
#define HUMI_HIGH_THRESHOLD  70    // 湿度高报警阈值(%)
#define HUMI_LOW_THRESHOLD   40    // 湿度低报警阈值(%)
#define LIGHT_LOW_THRESHOLD  40    // 光照低报警阈值(0-100)
#define SMOKE_HIGH_THRESHOLD 120   // 烟雾高报警阈值(ppm) - 方便演示取120

/* =================== 蓝牙参数化命令定义 =================== */
// 改进命令格式: 两位数字命令，例如 "01" 设置温度高阈值为35℃
// 支持的命令:
// 01 - 设置温度高阈值为35℃
// 02 - 设置温度低阈值为15℃  
// 03 - 设置湿度高阈值为80%
// 04 - 设置湿度低阈值为30%
// 05 - 设置光照低阈值为30%
// 06 - 设置烟雾高阈值为200ppm
// 07 - 启用报警并强制测试
// 08 - 禁用所有报警
// 09 - 查询当前状态
// 00 - 恢复默认阈值

#define BT_CMD_BUFFER_SIZE      20     // 蓝牙命令缓冲区大小

/* =================== LCD提示信息定义 =================== */
// LCD阈值修改提示结构
typedef struct {
    uint8_t active;           // 是否显示提示
    uint32_t start_time;      // 提示开始时间
    uint32_t duration;        // 提示持续时间(ms)
    char message[32];         // 提示消息内容
} LCD_Notification_t;

// 页面枚举
typedef enum {
    PAGE_TEMP_HUMID = 0,
    PAGE_LIGHT_SMOKE,
    PAGE_ATTITUDE,
    PAGE_BLUETOOTH,         // 新增蓝牙状态页面
    PAGE_SYSTEM_INFO
} PageType_t;

// 全局传感器数据结构
typedef struct {
    // 温湿度数据 (DHT11)
    uint8_t temperature;
    uint8_t humidity;
    uint8_t dht11_status;
    
    // 光照数据
    uint16_t light_raw_value;
    uint8_t light_percent;
    
    // 烟雾数据 (MQ-2)
    uint16_t smoke_ppm_value;        // MQ-2 ppm数值
    float smoke_percent;             // 保留百分比用于报警判断
    
    // 姿态数据 (MPU6050)
    MPU6050_Data_t mpu_data;
    uint8_t mpu_status;
    
    // 系统状态
    uint32_t error_count;
    uint32_t data_update_count;
} SensorData_t;

// 报警状态结构
typedef struct {
    uint8_t temp_high_alarm;
    uint8_t temp_low_alarm; 
    uint8_t humi_high_alarm;
    uint8_t humi_low_alarm;
    uint8_t light_low_alarm;
    uint8_t smoke_high_alarm;
    uint8_t any_alarm;
} AlarmStatus_t;

// 动态阈值结构 - 支持蓝牙远程修改
typedef struct {
    uint8_t temp_high;      // 温度高阈值
    uint8_t temp_low;       // 温度低阈值
    uint8_t humi_high;      // 湿度高阈值
    uint8_t humi_low;       // 湿度低阈值
    uint8_t light_low;      // 光照低阈值
    uint16_t smoke_high;    // 烟雾高阈值
} Thresholds_t;

// 蓝牙状态结构
typedef struct {
    uint8_t enabled;        // 蓝牙是否启用
    uint8_t connected;      // 是否有设备连接
    uint32_t last_command;  // 上次命令时间
    uint32_t command_count; // 命令计数
} BluetoothState_t;

/* =================== 全局变量 =================== */
SensorData_t sensor_data = {0};
AlarmStatus_t alarm_status = {0};
PageType_t current_page = PAGE_TEMP_HUMID;
PageType_t previous_page = PAGE_SYSTEM_INFO; // 初始化为不同值，强制第一次刷新
volatile uint32_t system_tick = 0;           // 改为volatile，由SysTick中断更新，供delay.c访问
uint8_t alarm_disabled = 0;                // 报警禁用标志（命令8使用）

// 动态阈值实例 - 初始化为默认值
Thresholds_t thresholds = {
    .temp_high = TEMP_HIGH_THRESHOLD,
    .temp_low = TEMP_LOW_THRESHOLD,
    .humi_high = HUMI_HIGH_THRESHOLD,
    .humi_low = HUMI_LOW_THRESHOLD,
    .light_low = LIGHT_LOW_THRESHOLD,
    .smoke_high = SMOKE_HIGH_THRESHOLD
};

// 蓝牙状态实例
BluetoothState_t bt_state = {0};

// LCD提示实例
LCD_Notification_t lcd_notification = {0};

// 蓝牙命令缓冲区
char bt_command_buffer[BT_CMD_BUFFER_SIZE] = {0};
uint8_t bt_command_ready = 0;

/* =================== 函数声明 =================== */
void System_Init(void);
void Sensors_Init(void);
void Data_Collection(void);
void Alarm_Check(void);
void Key_Handler(void);
void Display_Update(void);
void Bluetooth_Handler(void);                    // 蓝牙命令处理
void Bluetooth_ParseCommand(char* command);      // 参数化命令解析
void LCD_ShowNotification(char* message, uint32_t duration);  // 显示LCD提示
void LCD_UpdateNotification(void);               // 更新LCD提示状态

/* =================== 系统时钟相关 =================== */
// 非阻塞延时函数 - 修复版，避免死循环
void delay_ms_non_blocking(uint32_t ms)
{
    uint32_t start_time = system_tick;
    uint32_t timeout = ms + 1000;  // 添加超时保护，防止死循环
    
    while((system_tick - start_time) < ms)
    {
        // 非阻塞等待，添加超时保护
        if((system_tick - start_time) > timeout)
        {
            break;  // 超时退出，防止死循环
        }
        __NOP();  // 空操作，让CPU处理其他任务
    }
}

/* =================== 第1步：系统和传感器初始化 =================== */
void System_Init(void)
{
    // 基础系统初始化
    SystemInit();
    
    // 首先确保LCD能工作
    lcd_init();
    lcd_clear();
    lcd_print_str(0, 0, "Smart Agriculture");
    lcd_print_str(1, 0, "Starting...");
    
    // 配置SysTick定时器，1ms中断一次 - 移到LCD后避免中断干扰初始化
    SysTick_Config(SystemCoreClock / 1000);
    NVIC_SetPriority(SysTick_IRQn, 0);
    
    // 基础硬件初始化
    Led_Init();
    lcd_print_str(1, 0, "LED OK");
    delay_ms_non_blocking(300);
    
    Key_Init();
    lcd_print_str(1, 0, "KEY OK");
    delay_ms_non_blocking(300);
    
    Beep_Init();
    lcd_print_str(1, 0, "BEEP OK");
    delay_ms_non_blocking(300);
    
    // ADC初始化
    Adc3_Init();
    lcd_print_str(1, 0, "ADC OK");
    delay_ms_non_blocking(300);

#if ENABLE_BLUETOOTH
    // 蓝牙初始化 - 简化版，减少阻塞
    lcd_print_str(1, 0, "BT Init...");
    UART2_Init(UART_BAUD_9600);
    delay_ms_non_blocking(100);  // 短暂等待UART稳定
    
    Bluetooth_Init();
    bt_state.enabled = 1;
    lcd_print_str(1, 0, "BT OK");
    delay_ms_non_blocking(300);
#else
    lcd_print_str(1, 0, "BT Disabled");
    bt_state.enabled = 0;
    delay_ms_non_blocking(300);
#endif
    
