erinmi4/SmartAgriculture/USER/stm32f407project/src/main.c
    lcd_print_str(1, 0, "System Ready!");
    delay_ms_non_blocking(500);
    
#if ENABLE_BLUETOOTH
    // 发送蓝牙欢迎信息和命令格式说明
    delay_ms_non_blocking(100);  // 确保UART完全稳定
    Bluetooth_SendString("=== STM32 Smart Agriculture System ===\r\n");
    Bluetooth_SendString("Command Format: Two Digits (00-09)\r\n");
    Bluetooth_SendString("Commands Available:\r\n");
    Bluetooth_SendString("01-TempHigh35 02-TempLow15 03-HumiHigh80 04-HumiLow30\r\n");
    Bluetooth_SendString("05-LightLow30 06-SmokeHigh200 07-EnableAlarm 08-DisableAlarm\r\n");
    Bluetooth_SendString("09-QueryStatus 00-ResetDefaults\r\n");
    Bluetooth_SendString("Example: Send '01' to set temperature high alarm to 35C\r\n");
    Bluetooth_SendString("Ready for Two-Digit Commands!\r\n");
#endif
}

void Sensors_Init(void)
{
    char str[50];
    
    // 显示传感器初始化开始
    lcd_print_str(1, 0, "Sensors Init...");
    delay_ms_non_blocking(500);
    
#if ENABLE_DHT11
    // DHT11初始化
    lcd_print_str(1, 0, "DHT11...");
    dht11_init();
    delay_ms_non_blocking(500);
    
    // 测试DHT11读取
    uint8_t test_temp, test_humi;
    if(dht11_read_dat(&test_temp, &test_humi) == 0)
    {
        sensor_data.dht11_status = 1;
        sprintf(str, "DHT11 OK: %d%%,%dC", test_humi, test_temp);
        lcd_print_str(1, 0, str);
    }
    else
    {
        sensor_data.dht11_status = 0;
        lcd_print_str(1, 0, "DHT11 Failed");
    }
    delay_ms_non_blocking(1000);
#else
    lcd_print_str(1, 0, "DHT11 Disabled");
    sensor_data.dht11_status = 0;
    sensor_data.temperature = 25;  // 设置默认值
    sensor_data.humidity = 60;
    delay_ms_non_blocking(300);
#endif

#if ENABLE_LIGHT
    // 光敏电阻初始化
    lcd_print_str(1, 0, "Light Sensor...");
    Light_Init();
    delay_ms_non_blocking(200);
    
    // 测试光敏电阻读取
    uint16_t test_light = Light_GetRawValue();
    sprintf(str, "Light OK: %d", test_light);
    lcd_print_str(1, 0, str);
    delay_ms_non_blocking(500);
#else
    lcd_print_str(1, 0, "Light Disabled");
    sensor_data.light_raw_value = 2048;
    sensor_data.light_percent = 50;
    delay_ms_non_blocking(300);
#endif

#if ENABLE_MQ2
    // MQ-2烟雾传感器初始化
    lcd_print_str(1, 0, "MQ2 Sensor...");
    MQ2_Init();
    delay_ms_non_blocking(300);
    
    // 简化MQ2测试
    lcd_print_str(1, 0, "MQ2 Init Done");
    delay_ms_non_blocking(300);
#else
    lcd_print_str(1, 0, "MQ2 Disabled");
    sensor_data.smoke_ppm_value = 45;
    sensor_data.smoke_percent = 4.5f;
    delay_ms_non_blocking(300);
#endif

#if ENABLE_MPU6050
    // MPU6050初始化
    lcd_print_str(1, 0, "MPU6050...");
    if(MPU6050_Init() == 0)
    {
        sensor_data.mpu_status = 1;
        lcd_print_str(1, 0, "MPU6050 OK");
    }
    else
    {
        sensor_data.mpu_status = 0;
        sensor_data.error_count++;
        lcd_print_str(1, 0, "MPU6050 Failed");
    }
    delay_ms_non_blocking(500);
#else
    lcd_print_str(1, 0, "MPU6050 Disabled");
    sensor_data.mpu_status = 0;
    // 设置默认值
    sensor_data.mpu_data.accel_x = 0.0f;
    sensor_data.mpu_data.accel_y = 0.0f;
    sensor_data.mpu_data.accel_z = 1.0f;
    sensor_data.mpu_data.temp = 25.0f;
    delay_ms_non_blocking(300);
#endif
    
    // 初始化完成
    lcd_print_str(1, 0, "Sensors Ready!");
    delay_ms_non_blocking(1000);
    
    // 清屏准备进入主循环显示
    lcd_clear();
}

/* =================== 第2步：数据采集 =================== */
void Data_Collection(void)
{
    static uint32_t last_read = 0;
    
    // 每1000ms读取一次所有传感器（降低频率，减少系统负担）
    if(system_tick - last_read >= 1000)
    {
        last_read = system_tick;
        
#if ENABLE_DHT11
        // DHT11数据采集 - 只在状态正常时读取，增加读取间隔控制
        static uint32_t last_dht11_read = 0;
        if(sensor_data.dht11_status && (system_tick - last_dht11_read >= 3000))
        {
            last_dht11_read = system_tick;
            if(dht11_read_dat(&sensor_data.temperature, &sensor_data.humidity) != 0)
            {
                sensor_data.error_count++;
                // DHT11读取失败，但保持之前的数值
            }
        }
#else
        // DHT11被禁用，使用默认值
        sensor_data.temperature = 25;
        sensor_data.humidity = 60;
#endif

#if ENABLE_LIGHT
        // 光照数据采集 - 简化处理
        sensor_data.light_raw_value = Light_GetRawValue();
        if(sensor_data.light_raw_value > 4095) sensor_data.light_raw_value = 4095;
        
        // 使用专用函数获取百分比值
        sensor_data.light_percent = Light_GetValue();
        if(sensor_data.light_percent > 100) sensor_data.light_percent = 100;
#else
        sensor_data.light_raw_value = 2048;
        sensor_data.light_percent = 50;
#endif

#if ENABLE_MQ2
        // MQ2烟雾数据采集 - 简化版，减少等待时间
        MQ2_ClearFlag();
        MQ2_SendCommand();
        
        // 简化等待逻辑，避免长时间阻塞
        uint32_t wait_start = system_tick;
        while(!MQ2_IsDataReady() && (system_tick - wait_start) < 20)
        {
            // 最多等待20ms
        }
        
        if(MQ2_IsDataReady())
        {
            sensor_data.smoke_ppm_value = MQ2_GetValue();
            sensor_data.smoke_percent = (float)sensor_data.smoke_ppm_value / 10.0f;
        }
        else
        {
            sensor_data.error_count++;
        }
#else
        sensor_data.smoke_ppm_value = 45;
        sensor_data.smoke_percent = 4.5f;
#endif

#if ENABLE_MPU6050
        // MPU6050数据采集
        if(sensor_data.mpu_status)
        {
            MPU6050_GetData(&sensor_data.mpu_data);
        }
#else
        sensor_data.mpu_data.accel_x = 0.0f;
        sensor_data.mpu_data.accel_y = 0.0f;
        sensor_data.mpu_data.accel_z = 1.0f;
        sensor_data.mpu_data.gyro_x = 0.0f;
        sensor_data.mpu_data.gyro_y = 0.0f;
        sensor_data.mpu_data.gyro_z = 0.0f;
        sensor_data.mpu_data.temp = 25.0f;
#endif
        
        sensor_data.data_update_count++;
    }
}

/* =================== 第3步：报警检查 =================== */
void Alarm_Check(void)
{
    // 如果报警被禁用，直接返回
    if(alarm_disabled)
    {
        // 清除所有报警状态
        alarm_status.temp_high_alarm = 0;
        alarm_status.temp_low_alarm = 0;
        alarm_status.humi_high_alarm = 0;
        alarm_status.humi_low_alarm = 0;
        alarm_status.light_low_alarm = 0;
        alarm_status.smoke_high_alarm = 0;
        alarm_status.any_alarm = 0;
        
        // 确保蜂鸣器关闭
        Beep_Off();
        return;
    }
    
    // 温度报警检查 - 使用动态阈值
    alarm_status.temp_high_alarm = (sensor_data.temperature > thresholds.temp_high);
    alarm_status.temp_low_alarm = (sensor_data.temperature < thresholds.temp_low);
    
