erinmi4/SmartAgriculture/USER/stm32f407project/src/main.c
    // 湿度报警检查 - 使用动态阈值
    alarm_status.humi_high_alarm = (sensor_data.humidity > thresholds.humi_high);
    alarm_status.humi_low_alarm = (sensor_data.humidity < thresholds.humi_low);
    
    // 光照报警检查 - 使用动态阈值
    alarm_status.light_low_alarm = (sensor_data.light_percent < thresholds.light_low);
    
    // 烟雾报警检查 - 使用动态阈值
    alarm_status.smoke_high_alarm = (sensor_data.smoke_ppm_value > thresholds.smoke_high);
    
    // 强制测试报警（调试用）- 可以通过修改这里来测试蜂鸣器
    // alarm_status.temp_high_alarm = 1;  // 取消注释以强制触发报警测试蜂鸣器
    
    // 综合报警状态
    alarm_status.any_alarm = alarm_status.temp_high_alarm || alarm_status.temp_low_alarm ||
                            alarm_status.humi_high_alarm || alarm_status.humi_low_alarm ||
                            alarm_status.light_low_alarm || alarm_status.smoke_high_alarm;
    
#if ENABLE_ALARM
    // LED指示灯控制
    // LED0 - 烟雾报警
    if(alarm_status.smoke_high_alarm) {
        Led_On(LED0);
    } else {
        Led_Off(LED0);
    }
    
    // LED1 - 温度报警
    if(alarm_status.temp_high_alarm || alarm_status.temp_low_alarm) {
        Led_On(LED1);
    } else {
        Led_Off(LED1);
    }
    
#if ENABLE_BREATHING
    // LED2 - 湿度报警 (呼吸灯)
    if(alarm_status.humi_high_alarm || alarm_status.humi_low_alarm) {
        Led_BreathingEffect(LED2);
    } else {
        Led_Off(LED2);
    }
    
    // LED3 - 光照报警 (呼吸灯)
    if(alarm_status.light_low_alarm) {
        Led_BreathingEffect(LED3);
    } else {
        Led_Off(LED3);
    }
#else
    // 普通LED模式
    if(alarm_status.humi_high_alarm || alarm_status.humi_low_alarm) {
        Led_On(LED2);
    } else {
        Led_Off(LED2);
    }
    
    if(alarm_status.light_low_alarm) {
        Led_On(LED3);
    } else {
        Led_Off(LED3);
    }
#endif
    
    // 蜂鸣器报警 - 简化版：报警时直接开启，无报警时关闭
    if(alarm_status.any_alarm)
    {
        Beep_On();   // 报警时蜂鸣器一直响
    }
    else
    {
        Beep_Off();  // 无报警时关闭蜂鸣器
    }
#endif // ENABLE_ALARM
}

/* =================== 第4步：按键处理 =================== */
void Key_Handler(void)
{
    static uint32_t last_key_time = 0;
    static uint8_t key_pressed[4] = {0};
    
    // 按键防抖：200ms内只处理一次按键
    if(system_tick - last_key_time < 200)
        return;
    
    // 检测KEY0 - 温湿度页面
    if(Key_Debounce(KEY0_GPIO, KEY0_PIN))
    {
        if(!key_pressed[0])
        {
            current_page = PAGE_TEMP_HUMID;
            last_key_time = system_tick;
            key_pressed[0] = 1;
        }
    }
    else
    {
        key_pressed[0] = 0;
    }
    
    // 检测KEY1 - 光照烟雾页面
    if(Key_Debounce(KEY1_GPIO, KEY1_PIN))
    {
        if(!key_pressed[1])
        {
            current_page = PAGE_LIGHT_SMOKE;
            last_key_time = system_tick;
            key_pressed[1] = 1;
        }
    }
    else
    {
        key_pressed[1] = 0;
    }
    
    // 检测KEY2 - 姿态页面
    if(Key_Debounce(KEY2_GPIO, KEY2_PIN))
    {
        if(!key_pressed[2])
        {
            current_page = PAGE_ATTITUDE;
            last_key_time = system_tick;
            key_pressed[2] = 1;
        }
    }
    else
    {
        key_pressed[2] = 0;
    }
    
    // 检测KEY3 - 蓝牙状态页面 (新增)
    if(Key_Debounce(KEY3_GPIO, KEY3_PIN))
    {
        if(!key_pressed[3])
        {
            current_page = PAGE_BLUETOOTH;
            last_key_time = system_tick;
            key_pressed[3] = 1;
        }
    }
    else
    {
        key_pressed[3] = 0;
    }
    
    // 按住KEY2+KEY3同时按下进入系统信息页面
    static uint8_t combo_pressed = 0;
    if(Key_Debounce(KEY2_GPIO, KEY2_PIN) && Key_Debounce(KEY3_GPIO, KEY3_PIN))
    {
        if(!combo_pressed)
        {
            current_page = PAGE_SYSTEM_INFO;
            last_key_time = system_tick;
            combo_pressed = 1;
        }
    }
    else
    {
        combo_pressed = 0;
    }
}

/* =================== 第5步：显示更新 =================== */
void Display_Update(void)
{
    char str[50];
    
    // 优先处理LCD通知
    if(lcd_notification.active)
    {
        LCD_UpdateNotification();
        return;  // 通知期间不显示其他内容
    }
    
    // 只在页面变化时清屏
    if(current_page != previous_page)
    {
        lcd_clear();
        previous_page = current_page;
    }
    
    // 根据当前页面显示内容
    switch(current_page)
    {
        case PAGE_TEMP_HUMID:
            lcd_print_str(0, 0, "=== Temp/Humid ===");
            sprintf(str, "T:%dC H:%d%% %s", 
                    sensor_data.temperature, 
                    sensor_data.humidity,
                    alarm_status.temp_high_alarm ? "T-HIGH" : 
                    (alarm_status.temp_low_alarm ? "T-LOW" : 
                    (alarm_status.humi_high_alarm ? "H-HIGH" : 
                    (alarm_status.humi_low_alarm ? "H-LOW" : "OK"))));
            lcd_print_str(1, 0, str);
            break;
            
        case PAGE_LIGHT_SMOKE:
            lcd_print_str(0, 0, "=== Light/Smoke ===");
            sprintf(str, "L:%d%% MQ2:%dppm%s", 
                    sensor_data.light_percent, 
                    sensor_data.smoke_ppm_value,
                    (sensor_data.smoke_ppm_value == 0) ? "!" : 
                    (alarm_status.smoke_high_alarm ? "H" : ""));
            lcd_print_str(1, 0, str);
            break;
            
        case PAGE_ATTITUDE:
            lcd_print_str(0, 0, "=== MPU6050 ===");
            #if ENABLE_MPU6050
            // 如果MPU6050启用且状态正常，显示角度信息
            if(sensor_data.mpu_status)
            {
                // 使用新的角度显示功能
                MPU6050_Read_And_Display();
            }
            else
            {
                sprintf(str, "MPU6050 Offline");
                lcd_print_str(1, 0, str);
            }
            #else
            // MPU6050被禁用时显示默认信息
            sprintf(str, "X:%.1f Y:%.1f Z:%.1f", 
                    sensor_data.mpu_data.accel_x,
                    sensor_data.mpu_data.accel_y,
                    sensor_data.mpu_data.accel_z);
            lcd_print_str(1, 0, str);
            #endif
            break;
            
        case PAGE_BLUETOOTH:
            lcd_print_str(0, 0, "=== Bluetooth ===");
            sprintf(str, "BT:%s Cmd:%ld %s", 
                    bt_state.enabled ? "ON" : "OFF",
                    bt_state.command_count,
                    alarm_disabled ? "DISABLED" : "ENABLED");
            lcd_print_str(1, 0, str);
            break;
            
