erinmi4/SmartAgriculture/USER/stm32f407project/src/main.c
        case PAGE_SYSTEM_INFO:
            lcd_print_str(0, 0, "=== System Info ===");
            // 添加MQ2调试信息显示
            static uint8_t debug_mode = 0;
            static uint32_t last_switch = 0;
            
            // 每3秒切换显示内容
            if(system_tick - last_switch >= 3000)
            {
                last_switch = system_tick;
                debug_mode = (debug_mode + 1) % 3;
            }
            
            switch(debug_mode)
            {
                case 0: // 显示运行时间和错误
                    sprintf(str, "Time:%lds Err:%ld", 
                            system_tick / 1000, sensor_data.error_count);
                    break;
                case 1: // 显示MQ2状态
                    sprintf(str, "MQ2:%dppm Ready:%d", 
                            sensor_data.smoke_ppm_value, MQ2_IsDataReady());
                    break;
                case 2: // 显示传感器状态
                    sprintf(str, "DHT:%d L:%d MQ:%d", 
                            sensor_data.dht11_status,
                            (sensor_data.light_raw_value > 0 ? 1 : 0),
                            (sensor_data.smoke_ppm_value > 0 ? 1 : 0));
                    break;
            }
            lcd_print_str(1, 0, str);
            break;
    }
}

/* =================== 蓝牙处理函数 =================== */

/**
 * @brief 显示LCD通知提示
 * @param message: 提示消息
 * @param duration: 持续时间(ms)
 */
void LCD_ShowNotification(char* message, uint32_t duration)
{
    lcd_notification.active = 1;
    lcd_notification.start_time = system_tick;
    lcd_notification.duration = duration;
    strncpy(lcd_notification.message, message, sizeof(lcd_notification.message)-1);
    lcd_notification.message[sizeof(lcd_notification.message)-1] = '\0';
}

/**
 * @brief 更新LCD通知状态
 */
void LCD_UpdateNotification(void)
{
    if(lcd_notification.active)
    {
        // 检查是否超时
        if(system_tick - lcd_notification.start_time >= lcd_notification.duration)
        {
            lcd_notification.active = 0;
        }
        else
        {
            // 在屏幕顶部显示通知
            lcd_print_str(0, 0, lcd_notification.message);
        }
    }
}

/**
 * @brief 解析蓝牙两位数字命令（改进版 - 提高稳定性）
 * @param command: 命令字符串，格式如"01"表示设置温度高阈值
 */
void Bluetooth_ParseCommand(char* command)
{
    char response[100];
    int cmd_num;
    
    // 验证命令长度和格式
    if(strlen(command) < 2)
    {
        Bluetooth_SendString("ERROR: Command too short\r\n");
        Bluetooth_SendString("Format: Two digits (00-09)\r\n");
        Bluetooth_SendString("Example: 01, 02, 03...\r\n");
        return;
    }
    
    // 验证命令是否都是数字
    for(int i = 0; i < 2; i++)
    {
        if(command[i] < '0' || command[i] > '9')
        {
            sprintf(response, "ERROR: Invalid character '%c' in command\r\n", command[i]);
            Bluetooth_SendString(response);
            Bluetooth_SendString("Commands must be two digits: 00-09\r\n");
            return;
        }
    }
    
    // 解析两位数命令
    cmd_num = (command[0] - '0') * 10 + (command[1] - '0');
    
    // 发送命令接收确认
    sprintf(response, ">>> COMMAND RECEIVED: %02d <<<\r\n", cmd_num);
    Bluetooth_SendString(response);
    
    // 根据命令执行对应操作
    switch(cmd_num)
    {
        case 1: // 01 - 设置温度高阈值为35℃
            alarm_disabled = 0;  // 重新启用报警
            thresholds.temp_high = 35;
            sprintf(response, "SUCCESS: Temperature High = 35C (CMD:01)\r\n");
            LCD_ShowNotification("TempHigh: 35C", 2000);
            break;
            
        case 2: // 02 - 设置温度低阈值为15℃
            alarm_disabled = 0;  // 重新启用报警
            thresholds.temp_low = 15;
            sprintf(response, "SUCCESS: Temperature Low = 15C (CMD:02)\r\n");
            LCD_ShowNotification("TempLow: 15C", 2000);
            break;
            
        case 3: // 03 - 设置湿度高阈值为80%
            alarm_disabled = 0;  // 重新启用报警
            thresholds.humi_high = 80;
            sprintf(response, "SUCCESS: Humidity High = 80%% (CMD:03)\r\n");
            LCD_ShowNotification("HumiHigh: 80%", 2000);
            break;
            
        case 4: // 04 - 设置湿度低阈值为30%
            alarm_disabled = 0;  // 重新启用报警
            thresholds.humi_low = 30;
            sprintf(response, "SUCCESS: Humidity Low = 30%% (CMD:04)\r\n");
            LCD_ShowNotification("HumiLow: 30%", 2000);
            break;
            
        case 5: // 05 - 设置光照低阈值为30%
            alarm_disabled = 0;  // 重新启用报警
            thresholds.light_low = 30;
            sprintf(response, "SUCCESS: Light Low = 30%% (CMD:05)\r\n");
            LCD_ShowNotification("LightLow: 30%", 2000);
            break;
            
        case 6: // 06 - 设置烟雾高阈值为200ppm
            alarm_disabled = 0;  // 重新启用报警
            thresholds.smoke_high = 200;
            sprintf(response, "SUCCESS: Smoke High = 200ppm (CMD:06)\r\n");
            LCD_ShowNotification("SmokeHigh:200ppm", 2000);
            break;
            
        case 7: // 07 - 启用报警并强制测试
            // 重新启用报警功能
            alarm_disabled = 0;
            
            // 强制触发报警测试
            alarm_status.temp_high_alarm = 1;
            alarm_status.any_alarm = 1;
            
            sprintf(response, "SUCCESS: Alarm ENABLED & Test Triggered (CMD:07)\r\n");
            LCD_ShowNotification("Alarm ENABLED", 2000);
            break;
            
        case 8: // 08 - 禁用所有报警
            // 启用报警禁用标志，阻止Alarm_Check重新触发报警
            alarm_disabled = 1;
            
            // 清零所有报警状态
            alarm_status.temp_high_alarm = 0;
            alarm_status.temp_low_alarm = 0;
            alarm_status.humi_high_alarm = 0;
            alarm_status.humi_low_alarm = 0;
            alarm_status.light_low_alarm = 0;
            alarm_status.smoke_high_alarm = 0;
            alarm_status.any_alarm = 0;
            
            // 立即关闭蜂鸣器
            Beep_Off();
            
            sprintf(response, "SUCCESS: All Alarms DISABLED (CMD:08)\r\n");
            LCD_ShowNotification("Alarms DISABLED", 2000);
            break;
            
        case 9: // 09 - 查询当前状态
            sprintf(response, "=== SYSTEM STATUS (CMD:09) ===\r\n");
            Bluetooth_SendString(response);
            
            sprintf(response, "Temperature: %dC (Range: %d-%d)\r\n",
                    sensor_data.temperature, thresholds.temp_low, thresholds.temp_high);
            Bluetooth_SendString(response);
            
