erinmi4/SmartAgriculture/USER/stm32f407project/src/main.c
            sprintf(response, "Humidity: %d%% (Range: %d-%d)\r\n",
                    sensor_data.humidity, thresholds.humi_low, thresholds.humi_high);
            Bluetooth_SendString(response);
            
            sprintf(response, "Light: %d%% (Min: %d)\r\n",
                    sensor_data.light_percent, thresholds.light_low);
            Bluetooth_SendString(response);
            
            sprintf(response, "Smoke: %dppm (Max: %d)\r\n",
                    sensor_data.smoke_ppm_value, thresholds.smoke_high);
            Bluetooth_SendString(response);
            
            sprintf(response, "Alarms: %s | Disabled: %s\r\n",
                    alarm_status.any_alarm ? "ACTIVE" : "NONE",
                    alarm_disabled ? "YES" : "NO");
            Bluetooth_SendString(response);
            
            sprintf(response, "Sensors: DHT11=%s MPU6050=%s Light=%s\r\n",
                    sensor_data.dht11_status ? "OK" : "OFF",
                    sensor_data.mpu_status ? "OK" : "OFF",
                    sensor_data.light_raw_value > 0 ? "OK" : "OFF");
            Bluetooth_SendString(response);
            
            Bluetooth_SendString("=== STATUS QUERY COMPLETE ===\r\n");
            return;
            
        case 0: // 00 - 恢复默认阈值
            // 重新启用报警功能
            alarm_disabled = 0;
            
            // 恢复默认阈值
            thresholds.temp_high = TEMP_HIGH_THRESHOLD;
            thresholds.temp_low = TEMP_LOW_THRESHOLD;
            thresholds.humi_high = HUMI_HIGH_THRESHOLD;
            thresholds.humi_low = HUMI_LOW_THRESHOLD;
            thresholds.light_low = LIGHT_LOW_THRESHOLD;
            thresholds.smoke_high = SMOKE_HIGH_THRESHOLD;
            sprintf(response, "SUCCESS: All Thresholds Reset to Defaults & Alarm ENABLED (CMD:00)\r\n");
            LCD_ShowNotification("Reset & ENABLED", 2000);
            break;
            
        default:
            sprintf(response, "ERROR: Unknown command %02d\r\n", cmd_num);
            Bluetooth_SendString(response);
            Bluetooth_SendString("=== VALID COMMANDS (Two Digits) ===\r\n");
            Bluetooth_SendString("01-TempHigh35  02-TempLow15   03-HumiHigh80  04-HumiLow30\r\n");
            Bluetooth_SendString("05-LightLow30  06-SmokeHigh200 07-EnableAlarm 08-DisableAlarm\r\n");
            Bluetooth_SendString("09-QueryStatus 00-ResetDefaults\r\n");
            Bluetooth_SendString("Example: Send '01' (not '1') for TempHigh35\r\n");
            return;
    }
    
    // 发送执行结果确认
    Bluetooth_SendString(response);
    
    // 更新蓝牙状态
    bt_state.command_count++;
    bt_state.last_command = system_tick;
    
    // 发送最终确认
    sprintf(response, ">>> COMMAND %02d COMPLETED <<<\r\n", cmd_num);
    Bluetooth_SendString(response);
}

/**
 * @brief 蓝牙命令处理主函数（两位数命令版 - 增强调试）
 */
void Bluetooth_Handler(void)
{
#if ENABLE_BLUETOOTH
    static uint32_t last_bluetooth_check = 0;
    static uint32_t debug_counter = 0;
    
    // 每100ms检查一次蓝牙命令（适中的检查频率）
    if(system_tick - last_bluetooth_check >= 100)
    {
        last_bluetooth_check = system_tick;
        debug_counter++;
        
        // 每30秒发送一次简单的生存信号（用于调试连接状态）
        if(debug_counter % 300 == 0)  // 300 * 100ms = 30秒
        {
            char alive_msg[40];
            sprintf(alive_msg, "ALIVE: System OK [%ld]\r\n", debug_counter / 10);
            Bluetooth_SendString(alive_msg);
        }
        
        // 处理蓝牙命令
        if(bt_command_ready)
        {
            // 立即确认收到命令（增加时间戳）
            char ack_msg[50];
            sprintf(ack_msg, "ACK: Received at %lds\r\n", system_tick / 1000);
            Bluetooth_SendString(ack_msg);
            
            // 显示收到的原始命令
            char raw_cmd[50];
            sprintf(raw_cmd, "RAW: [%s] (len=%d)\r\n", bt_command_buffer, strlen(bt_command_buffer));
            Bluetooth_SendString(raw_cmd);
            
            // 处理完整命令
            Bluetooth_ParseCommand(bt_command_buffer);
            
            // 清空缓冲区
            memset(bt_command_buffer, 0, BT_CMD_BUFFER_SIZE);
            bt_command_ready = 0;
            
            // 发送处理完成确认
            Bluetooth_SendString("PROCESSING: Command completed\r\n");
        }
    }
#endif
}

/* =================== 主函数 =================== */
int main(void)
{
    // 系统初始化
    System_Init();
    
    // 传感器初始化
    Sensors_Init();
    
    // 主循环 - 简化版，专注于基础功能
    while(1)
    {
        // 系统运行指示 - LED每2秒闪烁一次（降低频率）
        static uint32_t last_led_toggle = 0;
        if(system_tick - last_led_toggle >= 2000)
        {
            last_led_toggle = system_tick;
            Led_Toggle(LED0);
        }
        
        // 数据采集 - 每1秒采集一次（降低频率）
        Data_Collection();
        
        // 报警检查
        Alarm_Check();
        
        // 按键处理
        Key_Handler();
        
        // 蓝牙命令处理
        Bluetooth_Handler();
        
        // 显示更新
        Display_Update();
        
        // 主循环无阻塞延时，让系统快速响应
    }
}
